{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Payments\Payments_ 1 Oct 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Oct 2018, 16:44:03
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-10-01.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,563 observations deleted)

{com}. *drop   LastPage
. 
. replace SurveyCode = upper(SurveyCode)
{txt}(449 real changes made)

{com}. replace SurveyCode = trim(SurveyCode)
{txt}(0 real changes made)

{com}. 
. replace WorkerID = upper(WorkerID)
{txt}(8 real changes made)

{com}. replace WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. isid    SurveyCode WorkerID
{txt}
{com}. 
. save    "${c -(}tempdir{c )-}\SurveyData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Payments\SurveyData.dta saved

{com}. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 LastPage = H
>                 Bonus = AE
>                 PieceRateImage = AC
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-10-01.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    if LastPage != "SurveyCode" // These guys didn't complete the survey
{txt}(776 observations deleted)

{com}. 
. replace SurveyCode = upper(SurveyCode)
{txt}(248 real changes made)

{com}. replace SurveyCode = trim(SurveyCode)
{txt}(0 real changes made)

{com}. 
. replace WorkerID = upper(WorkerID)
{txt}(10 real changes made)

{com}. replace WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. save    "${c -(}tempdir{c )-}\ExperimentData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Payments\ExperimentData.dta saved

{com}. 
. * Import data from MTurk
. 
. #d ;
{txt}delimiter now ;
{com}. import  delimited 
>                 "${c -(}rawdatadir{c )-}\Batch_3380463_batch_results.csv", 
>                 clear
>                 ;
{res}{text}(30 vars, 387 obs)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. *keep   assignmentid workerid answersurveycode approve reject
. 
. keep    if assignmentstatus == "Submitted"
{txt}(338 observations deleted)

{com}. 
. ren     answersurveycode SurveyCode
{res}{txt}
{com}. ren     workerid WorkerID
{res}{txt}
{com}. 
. foreach var of varlist SurveyCode WorkerID {c -(}
{txt}  2{com}.         replace `var' = upper(`var')
{txt}  3{com}.         replace `var' = trim(`var')
{txt}  4{com}. {c )-}       
{txt}(47 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. isid    SurveyCode WorkerID
{txt}
{com}. 
. merge   1:1 SurveyCode WorkerID using "${c -(}tempdir{c )-}\SurveyData", keep(1 3) keepusing(SurveyCode WorkerID Image)
{res}{txt}{p 0 7 2}
(note: variable
WorkerID was 
str14, now str26 to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              31
{txt}{col 9}from master{col 30}{res}              31{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              18{txt}  (_merge==3)
{col 5}{hline 41}

{com}. merge   1:1 SurveyCode WorkerID using "${c -(}tempdir{c )-}\ExperimentData", keep(1 3) keepusing(SurveyCode WorkerID Bonus PieceRateImage) gen(_merge1)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              22
{txt}{col 9}from master{col 30}{res}              22{txt}  (_merge1==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge1==2)

{col 5}matched{col 30}{res}              27{txt}  (_merge1==3)
{col 5}{hline 41}

{com}. 
. foreach         var of varlist approve reject Bonus {c -(}
{txt}  2{com}.         tostring        `var', replace
{txt}  3{com}.         replace         `var' = "" if `var' == "."
{txt}  4{com}. {c )-}
{txt}approve was {res:byte} now {res:str1}
(49 real changes made)
reject was {res:byte} now {res:str1}
(49 real changes made)
Bonus was {res:double} now {res:str4}
(22 real changes made)

{com}. 
. replace         approve = "x" if (_merge == 3 | _merge1 == 3)
{txt}(45 real changes made)

{com}. replace         reject = "Wrong worker id or survey code" if approve == ""
{txt}variable {bf}reject{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str30{sf}
{txt}(4 real changes made)

{com}. 
. ren             (SurveyCode WorkerID) (answersurveycode workerid)
{res}{txt}
{com}. 
. * Export sheet to accept or reject HITS on MTurk
. 
. preserve
{txt}
{com}.         drop    Image Bonus PieceRateImage _merge _merge1
{txt}
{com}.         export  delimited using "${c -(}outdir{c )-}\Approvals$S_DATE", replace 
{res}{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Payments\Approvals 1 Oct 2018.csv saved

{com}. restore
{txt}
{com}. 
. * Determine bonus payments
. 
. gen     BonusFormula = "grantBonus " + "–workerid " + workerid + " –amount " + Bonus + " –assignment " + assignmentid + " –reason " + `"""' + "Your earnings from the labor market experiment" + `"""'  if Bonus != "" & Bonus != "0"
{txt}(27 missing values generated)

{com}. keep    if BonusFormula != "" 
{txt}(27 observations deleted)

{com}. 
. keep            hitid assignmentid workerid Bonus BonusFormula
{txt}
{com}. destring        Bonus, replace
{txt}Bonus has all characters numeric; {res}replaced {txt}as {res}double
{txt}
{com}. 
. export          excel using "${c -(}outdir{c )-}\BonusPayments$S_DATE", firstrow(var) replace
{res}{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Payments\BonusPayments 1 Oct 2018.xls saved

{com}. 
. append          using "${c -(}outdir{c )-}\BonusPayments",
{txt}
{com}. duplicates      drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(22 observations deleted)

{com}. save            "${c -(}outdir{c )-}\BonusPayments", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Payments\BonusPayments.dta saved

{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Code\Analysis\DescriptiveStatistics.do"
{txt}
{com}. /* 
> This file generates an excel file which will be used to convert picture codes to graphic files
> Input: 
>         Demographic Survey Data
>         Experiment Data
> Output:
>         Approvals (file which is uploaded in MTurk to approve/reject submissions)
>         Bonus Payments (file which gives the code to use in CLI for bonus payments)
> 
> Written by: Sher Afghan Asad
> Date: 2018-09-24
>         
> */      
. 
. clear           all
{txt}
{com}. set                     more off
{txt}
{com}. capture         log close
{smcl}
{com}{sf}{ul off}