{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Analysis\_1_CleanData_21 Oct 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Oct 2018, 16:25:58
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,529 observations deleted)

{com}. keep    if LastPage == "Qualified"
{txt}(152 observations deleted)

{com}. 
. replace         WorkerID = subinstr(WorkerID, ": COPIED", "",.) 
{txt}(0 real changes made)

{com}. replace         WorkerID = upper(WorkerID)
{txt}(6 real changes made)

{com}. replace         WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. duplicates drop WorkerID Gender Race Age Education LastPage, force

{p 0 4}{txt}Duplicates in terms of {res} WorkerID Gender Race Age Education LastPage{p_end}

{txt}(6 observations deleted)

{com}. isid    WorkerID
{txt}
{com}. 
. save    "${c -(}tempdir{c )-}\DemographicData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Analysis\DemographicData.dta saved

{com}. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 WorkerID = P
>                 LastPage = H
>                 PieceRate = AH
>                 GuessedPieceRate = AI
>                 FairPieceRate = AJ
>                 GuessedPoints = AN
>                 Treatment = AG
>                 Points = AL
>                 GroupID = AF
>                 Role = O
>                 Feedback = AB
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/16
{txt}(16 observations deleted)

{com}. drop    if GroupID == 1 & PieceRate == 0
{txt}(2 observations deleted)

{com}. drop    if LastPage == "" 
{txt}(676 observations deleted)

{com}. 
. * Workers in following groups participated on phone so they couldn't do the button pressing task
. 
. #d ;
{txt}delimiter now ;
{com}. drop    if GroupID == 4 | GroupID == 18 | GroupID == 41 | GroupID == 53 |
>                 GroupID == 71 | GroupID == 125
>                 ;
{txt}(12 observations deleted)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. * Workers in following groups dropped out before working on the task
. 
. #d ;
{txt}delimiter now ;
{com}. drop    if GroupID == 6 | GroupID == 8 | GroupID == 14 | GroupID == 16 | 
>                 GroupID == 17 | GroupID == 21 | GroupID == 22 | GroupID == 24 |
>                 GroupID == 32 | GroupID == 35 | GroupID == 38 | GroupID == 39 |
>                 GroupID == 46 | GroupID == 49 | GroupID == 67 | GroupID == 77 |
>                 GroupID == 78 | GroupID == 80 | GroupID == 82 | GroupID == 92 | 
>                 GroupID == 95 | GroupID == 97 | GroupID == 105 | GroupID == 126 |
>                 GroupID == 127 | GroupID == 134 | GroupID == 141 | GroupID == 145 |
>                 GroupID == 149 | GroupID == 152 | GroupID == 154 | GroupID == 157 |
>                 GroupID == 159 | GroupID == 165
>                 ;
{txt}(68 observations deleted)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. * Assigned to Multiple treatments
. 
. drop    if GroupID == 136 | GroupID == 131
{txt}(4 observations deleted)

{com}. 
. * Drop subjects which did not provide M-Turk ID
. 
. gen             ID = _n
{txt}
{com}. tostring        ID, replace
{txt}ID was {res:float} now {res:str3}

{com}. replace         WorkerID = ID if WorkerID == "NOT PROVIDED"
{txt}(15 real changes made)

{com}. replace         WorkerID = subinstr(WorkerID, ": COPIED", "",.) 
{txt}(1 real change made)

{com}. replace         WorkerID = upper(WorkerID)
{txt}(2 real changes made)

{com}. replace         WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. *drop   if LastPage != "SurveyCode" // These guys didn't complete the survey
. drop    LastPage
{txt}
{com}. *drop   if WorkerID == "AZ5ZYUCAQ0XDL" & Treatment == "Baseline"
. 
. * Dropping groups that scored zero points, this must be because of technical issues
. 
. drop    if Points == 0 
{txt}(44 observations deleted)

{com}. 
. isid            WorkerID
{txt}
{com}. merge           1:1 WorkerID using "${c -(}tempdir{c )-}\DemographicData", keep(1 3) keepusing(Gender Race Age Education) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              15
{txt}{col 9}from master{col 30}{res}              15{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}             187{txt}  
{col 5}{hline 41}

{com}. 
. replace         Gender = "Male" if Gender == "" 
{txt}(15 real changes made)

{com}. replace         Race = "Black or African-American" if Race == ""
{txt}(15 real changes made)

{com}. 
. replace         Education = "College Graduate" if Education == "other_:Bachelors Degree"  
{txt}(0 real changes made)

{com}. replace         Gender = "" if Gender == "Prefer not to answer" | Gender == "other_:transgender female"
{txt}(2 real changes made)

{com}. replace         Education = "Master's Degree" if Education == "Professional Degree"
{txt}(3 real changes made)

{com}. replace         Education = "High School or equivalent" if Education == "Vocational/Technical School"
{txt}(12 real changes made)

{com}. 
. label           define education 1 "Less than high school" 2 "High School or equivalent" 3 "Some College" 4 "College Graduate" 5 "Master's Degree" 6 "Doctoral Degree"
{txt}
{com}. encode          Education, gen(EducEnc) label(education) noextend
{txt}
{com}. drop            Education
{txt}
{com}. ren             EducEnc Education
{res}{txt}
{com}. 
. * Gender
. 
. gen             Male = (Gender == "Male") * 100
{txt}
{com}. gen             Female = (Gender == "Female") * 100
{txt}
{com}. 
. * Age
. 
. tabulate        Age, gen(Age)

        {txt}Age {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      18-24 {c |}{res}         21       11.23       11.23
{txt}      25-30 {c |}{res}         54       28.88       40.11
{txt}      31-40 {c |}{res}         70       37.43       77.54
{txt}      41-50 {c |}{res}         20       10.70       88.24
{txt}      51-64 {c |}{res}         19       10.16       98.40
{txt} 65 or over {c |}{res}          3        1.60      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        187      100.00
{txt}
{com}. foreach         var of varlist Age1-Age6 {c -(}
{txt}  2{com}. replace         `var' = `var'*100
{txt}  3{com}. {c )-}
{txt}(21 real changes made)
(54 real changes made)
(70 real changes made)
(20 real changes made)
(19 real changes made)
(3 real changes made)

{com}. 
. * Education
. 
. tabulate        Education, gen(Education)

                {txt}Education {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
    Less than high school {c |}{res}          2        1.07        1.07
{txt}High School or equivalent {c |}{res}         24       12.83       13.90
{txt}             Some College {c |}{res}         55       29.41       43.32
{txt}         College Graduate {c |}{res}         73       39.04       82.35
{txt}          Master's Degree {c |}{res}         30       16.04       98.40
{txt}          Doctoral Degree {c |}{res}          3        1.60      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        187      100.00
{txt}
{com}. foreach         var of varlist Education1-Education6 {c -(}
{txt}  2{com}. replace         `var' = `var'*100
{txt}  3{com}. {c )-}
{txt}(2 real changes made)
(24 real changes made)
(55 real changes made)
(73 real changes made)
(30 real changes made)
(3 real changes made)

{com}. 
. * Race
. 
. tab                     Race, gen(Race)

                                 {txt}Race {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
            Black or African-American {c |}{res}         37       18.32       18.32
{txt}                   White or Caucasian {c |}{res}        165       81.68      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}        202      100.00
{txt}
{com}. 
. * Employer Race
. 
. bysort          GroupID (Role): gen EmployerRace = Race[1]
{txt}
{com}. 
. save            "${c -(}outdir{c )-}\CleanedData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\CleanedData.dta saved

{com}. 
{txt}end of do-file

{com}. 
. * Summarize Demographics
. 
. do                      "${c -(}codedir{c )-}\_2_SummarizeDemographicData.do"
{txt}
{com}. /* 
> This file summarize the demographic data for the paper. 
> 
> Input: 
>         Cleaned Data
> Output:
>         Table 1: Demogrphics
>         Figure 1: Demographics
> */      
. 
. clear           all
{txt}
{com}. set                     more off
{txt}
{com}. capture         log close
{smcl}
{com}{sf}{ul off}