{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Analysis\Analysis_19 Oct 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Oct 2018, 18:22:31
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,529 observations deleted)

{com}. keep    if LastPage == "Qualified"
{txt}(152 observations deleted)

{com}. 
. replace         WorkerID = subinstr(WorkerID, ": COPIED", "",.) 
{txt}(0 real changes made)

{com}. replace         WorkerID = upper(WorkerID)
{txt}(6 real changes made)

{com}. replace         WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. duplicates drop WorkerID Gender Race Age Education LastPage, force

{p 0 4}{txt}Duplicates in terms of {res} WorkerID Gender Race Age Education LastPage{p_end}

{txt}(6 observations deleted)

{com}. isid    WorkerID
{txt}
{com}. 
. save    "${c -(}tempdir{c )-}\DemographicData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Analysis\DemographicData.dta saved

{com}. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 WorkerID = P
>                 LastPage = H
>                 PieceRate = AH
>                 GuessedPieceRate = AI
>                 FairPieceRate = AJ
>                 GuessedPoints = AN
>                 Treatment = AG
>                 Points = AL
>                 GroupID = AF
>                 Role = O
>                 Feedback = AB
>                 IPAddress = I
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/16
{txt}(16 observations deleted)

{com}. drop    if GroupID == 1 & PieceRate == 0
{txt}(2 observations deleted)

{com}. drop    if LastPage == "" 
{txt}(676 observations deleted)

{com}. 
. * Workers in following groups participated on phone so they couldn't do the button pressing task
. 
. #d ;
{txt}delimiter now ;
{com}. drop    if GroupID == 4 | GroupID == 18 | GroupID == 41 | GroupID == 53 |
>                 GroupID == 71 | GroupID == 125
>                 ;
{txt}(12 observations deleted)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. * Workers in following groups dropped out before working on the task
. 
. #d ;
{txt}delimiter now ;
{com}. drop    if GroupID == 6 | GroupID == 8 | GroupID == 14 | GroupID == 16 | 
>                 GroupID == 17 | GroupID == 21 | GroupID == 22 | GroupID == 24 |
>                 GroupID == 32 | GroupID == 35 | GroupID == 38 | GroupID == 39 |
>                 GroupID == 46 | GroupID == 49 | GroupID == 67 | GroupID == 77 |
>                 GroupID == 78 | GroupID == 80 | GroupID == 82 | GroupID == 92 | 
>                 GroupID == 95 | GroupID == 97 | GroupID == 105 | GroupID == 126 |
>                 GroupID == 127 | GroupID == 134 | GroupID == 141 | GroupID == 145 |
>                 GroupID == 149 | GroupID == 152 | GroupID == 154 | GroupID == 157 |
>                 GroupID == 159 | GroupID == 165
>                 ;
{txt}(68 observations deleted)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. * Assigned to Multiple treatments
. 
. drop    if GroupID == 136 | GroupID == 131
{txt}(4 observations deleted)

{com}. 
. * Drop subjects which did not provide M-Turk ID
. 
. gen             ID = _n
{txt}
{com}. tostring        ID, replace
{txt}ID was {res:float} now {res:str3}

{com}. replace         WorkerID = ID if WorkerID == "NOT PROVIDED"
{txt}(15 real changes made)

{com}. replace         WorkerID = subinstr(WorkerID, ": COPIED", "",.) 
{txt}(1 real change made)

{com}. replace         WorkerID = upper(WorkerID)
{txt}(2 real changes made)

{com}. replace         WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. *drop   if LastPage != "SurveyCode" // These guys didn't complete the survey
. drop    LastPage
{txt}
{com}. *drop   if WorkerID == "AZ5ZYUCAQ0XDL" & Treatment == "Baseline"
. 
. * Dropping groups that scored zero points, this must be because of technical issues
. 
. drop    if Points == 0 
{txt}(44 observations deleted)

{com}. 
. isid            WorkerID
{txt}
{com}. merge           1:1 WorkerID using "${c -(}tempdir{c )-}\DemographicData", keep(1 3) keepusing(Gender Race Age Education) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              15
{txt}{col 9}from master{col 30}{res}              15{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}             187{txt}  
{col 5}{hline 41}

{com}. 
. * Bringing in the country of the subject using IP Address
. stop
{err}command {bf}stop{sf} is unrecognized
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. levelsof IPAddress, local(IP)
{txt}`"10.101.218.175"' `"10.101.253.141"' `"10.102.241.189"' `"10.109.210.198"' `"10.109.225.219"' `"10.11.200.153"' `"10.11.238.245"' `"10.11.251.113"' `"10.11.254.182"' `"10.111.224.2"' `"10.13.179.222"' `"10.13.184.197"' `"10.136.199.55"' `"10.136.94.47"' `"10.147.20.4"' `"10.148.26.138"' `"10.148.41.22"' `"10.148.82.74"' `"10.153.172.52"' `"10.155.96.176"' `"10.159.162.165"' `"10.159.194.165"' `"10.16.204.85"' `"10.16.233.19"' `"10.165.237.19"' `"10.167.214.113"' `"10.167.30.124"' `"10.167.68.220"' `"10.168.81.123"' `"10.170.101.130"' `"10.178.157.241"' `"10.178.210.142"' `"10.178.24.114"' `"10.180.179.229"' `"10.181.92.244"' `"10.182.117.207"' `"10.182.160.55"' `"10.182.199.117"' `"10.182.99.110"' `"10.184.151.180"' `"10.186.91.179"' `"10.233.90.146"' `"10.30.0.60"' `"10.30.225.244"' `"10.30.235.45"' `"10.30.36.33"' `"10.30.67.242"' `"10.30.69.116"' `"10.30.70.204"' `"10.30.74.198"' `"10.30.81.13"' `"10.31.126.71"' `"10.31.242.53"' `"10.31.68.214"' `"10.31.72.164"' `"10.33.205.248"' `"10.33.232.176"' `"10.33.235.94"' `"10.33.254.119"' `"10.35.135.242"' `"10.35.179.184"' `"10.35.191.213"' `"10.35.205.108"' `"10.35.220.176"' `"10.35.246.50"' `"10.37.152.251"' `"10.37.176.161"' `"10.37.182.119"' `"10.37.233.24"' `"10.37.236.82"' `"10.37.251.208"' `"10.37.251.47"' `"10.41.160.184"' `"10.41.198.116"' `"10.43.205.53"' `"10.43.208.95"' `"10.45.123.32"' `"10.45.224.215"' `"10.45.249.93"' `"10.45.46.187"' `"10.45.76.149"' `"10.45.90.162"' `"10.47.139.236"' `"10.47.180.204"' `"10.5.165.56"' `"10.5.191.4"' `"10.5.196.67"' `"10.5.243.223"' `"10.51.174.170"' `"10.51.184.156"' `"10.51.189.148"' `"10.51.190.34"' `"10.51.223.62"' `"10.61.129.138"' `"10.61.152.110"' `"10.61.181.115"' `"10.61.181.95"' `"10.61.195.14"' `"10.61.204.254"' `"10.61.240.254"' `"10.61.249.31"' `"10.63.125.141"' `"10.63.146.94"' `"10.63.150.180"' `"10.63.182.159"' `"10.63.189.231"' `"10.63.228.215"' `"10.63.243.194"' `"10.63.34.152"' `"10.63.64.42"' `"10.63.65.75"' `"10.63.73.225"' `"10.65.100.84"' `"10.65.111.236"' `"10.65.243.160"' `"10.65.97.124"' `"10.67.229.158"' `"10.67.231.31"' `"10.7.158.42"' `"10.7.229.137"' `"10.7.229.230"' `"10.7.250.69"' `"10.79.244.79"' `"10.81.159.108"' `"10.81.192.176"' `"10.81.224.221"' `"10.81.237.23"' `"10.81.247.113"' `"10.81.250.149"' `"10.81.253.117"' `"10.9.193.73"' `"10.9.234.25"' `"10.95.165.34"' `"10.95.176.19"' `"10.95.199.248"' `"10.99.224.73"' `"10.99.225.205"'

{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}.         keep            IPAddress
{txt}
{com}. 
{txt}end of do-file

{com}. insheet using http://ip-api.com/csv/10.101.218.175, clear nonames
{txt}(3 vars, 1 obs)

{com}. br

. insheet using http://ip-api.com/csv/10.101.253.141, clear nonames
{txt}(3 vars, 1 obs)

{com}. insheet using http://ip-api.com/csv/"10.101.253.141", clear nonames
{err}invalid '"10.101.253.141' 
{txt}{search r(198):r(198);}

{com}. insheet using http://ip-api.com/csv/10.99.225.205, clear nonames
{txt}(3 vars, 1 obs)

{com}. insheet using http://ip-api.com/csv/208.80.152.201, clear nonames
{txt}(14 vars, 1 obs)

{com}. exit, clear
