{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Analysis\Analysis_27 Sep 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Sep 2018, 23:07:33
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-09-27.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,687 observations deleted)

{com}. keep    if LastPage == "Qualified"
{txt}(101 observations deleted)

{com}. 
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)

{com}. *isid   WorkerID
. 
. save    "${c -(}tempdir{c )-}\DemographicData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Analysis\DemographicData.dta saved

{com}. 
. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 WorkerID = P
>                 LastPage = H
>                 PieceRate = AH
>                 Treatment = AG
>                 Points = AL
>                 GroupID = AF
>                 Role = O
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-09-27.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/16
{txt}(16 observations deleted)

{com}. drop    if LastPage != "SurveyCode" // These guys didn't complete the survey
{txt}(836 observations deleted)

{com}. drop    LastPage
{txt}
{com}. isid            WorkerID
{txt}
{com}. merge           1:m WorkerID using "${c -(}tempdir{c )-}\DemographicData", keep(3) keepusing(Gender Race Age Education) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             170{txt}  
{col 5}{hline 41}

{com}. 
. * Variation in piece rates
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count) if Role == 1, 
>                 over(PieceRate) over(Race)
>                 ytitle(Frequency) 
>                 title("Piece-Rate Distribution") 
>                 note("Note: This graph represents the distribution of piece rates (in dollars per 100 points) as selected" "by Black and White Employers. ", 
>                 margin(zero))
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}.                 
. graph   export "${c -(}outdir{c )-}\PieceRateDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\PieceRateDistribution27 Sep 2018.png written in PNG format)

{com}.                 
. * Demographics of Subjects
. 
. * Gender
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count), 
>                 over(Gender) over(Race) 
>                 asyvars  
>                 title("Gender Distribution") 
>                 note("Note: This graph represents the gender distribution of subjects by racial groups.",margin(zero)) 
>                 
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\GenderDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\GenderDistribution27 Sep 2018.png written in PNG format)

{com}. 
. * Age
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count), 
>                 over(Age) over(Race) 
>                 asyvars  
>                 title("Age Distribution") 
>                 note("Note: This graph represents the age distribution of subjects by racial groups.",margin(zero)) 
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\AgeDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\AgeDistribution27 Sep 2018.png written in PNG format)

{com}. 
. * Education
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count), 
>                 over(Education) over(Race) 
>                 asyvars  
>                 title("Education Distribution") 
>                 note("Note: This graph represents the education distribution of subjects by racial groups.",margin(zero)) 
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\EducationDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\EducationDistribution27 Sep 2018.png written in PNG format)

{com}. 
. * Effort against different piece rates
. stop
{err}command {bf}stop{sf} is unrecognized
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. tabstat Points if Role == 1 & Treatment == "Baseline", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        1         .         0
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}       19  999.4546  1323.105
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}       27  1140.356  1446.926
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        5  1174.365     756.2
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       52  1094.248  1307.442
{txt}{hline 10}{c BT}{hline 30}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. tabstat Points if Role == 1 & Race == "Black or African-American", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:.03} {...}
{c |}{...}
 {res}        5  794.5942       511
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}        5  1834.826    1334.2
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       10  1401.825     922.6
{txt}{hline 10}{c BT}{hline 30}

{com}. 
{txt}end of do-file

{com}. tabstat Points if Role == 1 & Race == "White or Caucasian", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        2  77.07464      54.5
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}       28  1069.324  1245.071
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}       41  1116.026  1418.488
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        8  1305.223    1102.5
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       79  1113.395  1290.494
{txt}{hline 10}{c BT}{hline 30}

{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. tabstat Points if Role == 1 & Race == "Black or African-American" & Treatment == "Race Salient", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:.03} {...}
{c |}{...}
 {res}        2         0         0
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}        3  1940.711  2223.667
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}        5  1834.826    1334.2
{txt}{hline 10}{c BT}{hline 30}

{com}. 
{txt}end of do-file

{com}. tabstat Points if Role == 1 & Race == "White or Caucasian" & Treatment == "Race Salient", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        1         .       109
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}       12  1140.404  1023.167
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}       16  1131.375  1193.188
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        3  1550.763  1679.667
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       32  1142.455  1141.156
{txt}{hline 10}{c BT}{hline 30}

{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. drop    if Points == 0 
{txt}(47 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. tabstat Points if Role == 1 & Treatment == "Baseline", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:.03} {...}
{c |}{...}
 {res}       14  685.0743  1795.643
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}       18  571.2303  2170.389
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        2  1108.036    1890.5
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       34  651.5107  1999.618
{txt}{hline 10}{c BT}{hline 30}

{com}. tabstat Points if Role == 1 & Race == "Black or African-American" & Treatment == "Race Salient", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:.06} {...}
{c |}{...}
 {res}        2  340.1184    3335.5
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}        2  340.1184    3335.5
{txt}{hline 10}{c BT}{hline 30}

{com}. tabstat Points if Role == 1 & Race == "White or Caucasian" & Treatment == "Race Salient", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        1         .       109
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}        8  1070.681   1534.75
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}        9  430.5539  2121.222
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        2  760.1398    2519.5
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       20  901.9955   1825.85
{txt}{hline 10}{c BT}{hline 30}

{com}. 
{txt}end of do-file

{com}. exit, clear
