{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Analysis\Analysis_ 7 Oct 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Oct 2018, 23:00:32
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,529 observations deleted)

{com}. keep    if LastPage == "Qualified"
{txt}(152 observations deleted)

{com}. 
. replace         WorkerID = subinstr(WorkerID, ": COPIED", "",.) 
{txt}(0 real changes made)

{com}. replace         WorkerID = upper(WorkerID)
{txt}(6 real changes made)

{com}. replace         WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. duplicates drop WorkerID Gender Race Age Education LastPage, force

{p 0 4}{txt}Duplicates in terms of {res} WorkerID Gender Race Age Education LastPage{p_end}

{txt}(6 observations deleted)

{com}. isid    WorkerID
{txt}
{com}. 
. save    "${c -(}tempdir{c )-}\DemographicData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Analysis\DemographicData.dta saved

{com}. 
. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 WorkerID = P
>                 LastPage = H
>                 PieceRate = AH
>                 Treatment = AG
>                 Points = AL
>                 GroupID = AF
>                 Role = O
>                 Feedback = AB
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/16
{txt}(16 observations deleted)

{com}. drop    if GroupID == 1 & PieceRate == 0
{txt}(2 observations deleted)

{com}. drop    if LastPage == "" 
{txt}(676 observations deleted)

{com}. 
. * Workers in following groups participated on phone so they couldn't do the button pressing task
. 
. #d ;
{txt}delimiter now ;
{com}. drop    if GroupID == 4 | GroupID == 18 | GroupID == 41 | GroupID == 53 |
>                 GroupID == 71 | GroupID == 125
>                 ;
{txt}(12 observations deleted)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. * Workers in following groups dropped out before working on the task
. 
. #d ;
{txt}delimiter now ;
{com}. drop    if GroupID == 6 | GroupID == 8 | GroupID == 14 | GroupID == 16 | 
>                 GroupID == 17 | GroupID == 21 | GroupID == 22 | GroupID == 24 |
>                 GroupID == 32 | GroupID == 35 | GroupID == 38 | GroupID == 39 |
>                 GroupID == 46 | GroupID == 49 | GroupID == 67 | GroupID == 77 |
>                 GroupID == 78 | GroupID == 80 | GroupID == 82 | GroupID == 92 | 
>                 GroupID == 95 | GroupID == 97 | GroupID == 105 | GroupID == 126 |
>                 GroupID == 127 | GroupID == 134 | GroupID == 141 | GroupID == 145 |
>                 GroupID == 149 | GroupID == 152 | GroupID == 154 | GroupID == 157 |
>                 GroupID == 159 | GroupID == 165
>                 ;
{txt}(68 observations deleted)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. * Assigned to Multiple treatments
. 
. drop    if GroupID == 136 | GroupID == 131
{txt}(4 observations deleted)

{com}. 
. * Drop subjects which did not provide M-Turk ID
. 
. gen             ID = _n
{txt}
{com}. tostring        ID, replace
{txt}ID was {res:float} now {res:str3}

{com}. replace         WorkerID = ID if WorkerID == "NOT PROVIDED"
{txt}(15 real changes made)

{com}. replace         WorkerID = subinstr(WorkerID, ": COPIED", "",.) 
{txt}(1 real change made)

{com}. replace         WorkerID = upper(WorkerID)
{txt}(2 real changes made)

{com}. replace         WorkerID = trim(WorkerID)
{txt}(0 real changes made)

{com}. 
. *drop   if LastPage != "SurveyCode" // These guys didn't complete the survey
. drop    LastPage
{txt}
{com}. *drop   if WorkerID == "AZ5ZYUCAQ0XDL" & Treatment == "Baseline"
. 
. isid            WorkerID
{txt}
{com}. merge           1:1 WorkerID using "${c -(}tempdir{c )-}\DemographicData", keep(1 3) keepusing(Gender Race Age Education) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              20
{txt}{col 9}from master{col 30}{res}              20{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}             226{txt}  
{col 5}{hline 41}

{com}. 
. tab             Race

                                 {txt}Race {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
            Black or African-American {c |}{res}         27       11.95       11.95
{txt}                   White or Caucasian {c |}{res}        199       88.05      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}        226      100.00
{txt}
{com}. replace         Education = "College Graduate" if Education == "other_:Bachelors Degree"  
{txt}(1 real change made)

{com}. replace         Gender = "" if Gender == "Prefer not to answer" | Gender == "other_:transgender female"
{txt}(2 real changes made)

{com}. replace         Education = "Master's Degree" if Education == "Professional Degree"
{txt}(4 real changes made)

{com}. replace         Education = "High School or equivalent" if Education == "Vocational/Technical School"
{txt}(13 real changes made)

{com}. 
. label           define education 1 "Less than high school" 2 "High School or equivalent" 3 "Some College" 4 "College Graduate" 5 "Master's Degree" 6 "Doctoral Degree"
{txt}
{com}. encode          Education, gen(EducEnc) label(education) noextend
{txt}
{com}. drop            Education
{txt}
{com}. ren             EducEnc Education
{res}{txt}
{com}. 
. * Variation in piece rates
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count) if Role == 1, 
>                 over(PieceRate) over(Race)
>                 ytitle(Frequency) 
>                 title("Piece-Rate Distribution") 
>                 note("Note: This graph represents the distribution of piece rates (in dollars per 100 points) as selected" "by Black and White Employers. ", 
>                 margin(zero))
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}.                 
. graph   export "${c -(}outdir{c )-}\PieceRateDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\PieceRateDistribution 7 Oct 2018.png written in PNG format)

{com}.                 
. * Demographics of Subjects
. 
. * Gender
. 
. gen     Male = (Gender == "Male") * 100
{txt}
{com}. gen     Female = (Gender == "Female") * 100
{txt}
{com}. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar 
>                 (mean) Male 
>                 (mean) Female, 
>                 over(Race) 
>                 ytitle(Percentage) 
>                 title("Overall Gender Distribution") 
>                 note("Note: This graph represents the gender distribution of subjects by racial groups.") 
>                 legend(order(1 "Male" 2 "Female")) 
>                 scheme(s2mono)
>                 saving("${c -(}outdir{c )-}\Gender", replace)
>                 ;
{res}{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Gender.gph saved)

{com}. #d cr
{txt}delimiter now cr
{com}. 
. stop            
{err}command {bf}stop{sf} is unrecognized
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. graph bar (count), over(Age)
{res}
{com}. graph bar (count), over(Age) over(Race)
{res}
{com}. graph bar (count), over(Age) over(Race) over(Role)
{res}
{com}. graph bar, over(Age) over(Race) over(Role)
{res}
{com}. graph bar, over(Age) over(Race)
{res}
{com}. graph hbar, over(Age) over(Race)
{res}
{com}. graph hbar (count), over(Age) over(Race)
{res}
{com}. graph hbar, over(Age) over(Race)
{res}
{com}. graph hbar, over(Age) over(Race) percentages
{res}
{com}. graph hbar, over(Age) over(Race) percentages stack
{res}
{com}. graph bar, over(Age) over(Race) percentages
{res}
{com}. twoway (bar Male Race)
{err}string variables not allowed in varlist;
{bf}Race{sf} is a string variable
{txt}{search r(109):r(109);}

{com}. tab Age

        {txt}Age {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      18-24 {c |}{res}         26       11.50       11.50
{txt}      25-30 {c |}{res}         61       26.99       38.50
{txt}      31-40 {c |}{res}         88       38.94       77.43
{txt}      41-50 {c |}{res}         25       11.06       88.50
{txt}      51-64 {c |}{res}         23       10.18       98.67
{txt} 65 or over {c |}{res}          3        1.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        226      100.00

{com}. ssc install catplot
{txt}checking {hilite:catplot} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

{com}. help catplot

. catplot Gender
{res}
{com}. catplot Gender, by(Race)
{res}
{com}. catplot Gender, over(Race)
{res}
{com}. catplot Gender, over(Race) percent(Race)
{res}
{com}. catplot Gender, over(Race) percent(Race) recast(hbar)
{res}
{com}. catplot Gender, over(Race) percent(Race) recast(bar)
{res}
{com}. catplot Gender, over(Race) percent(Race) recast(bar) ylabel(Percentage)
{res}{err}invalid label specifier, :  Percentage:
{txt}{search r(198):r(198);}

{com}. catplot Gender, over(Race) percent(Race) recast(bar) ylabel("Percentage")
{res}{err}invalid label specifier, :  "Percentage":
{txt}{search r(198):r(198);}

{com}. catplot Gender, over(Race) percent(Race) recast(dot)
{res}
{com}. catplot Gender, over(Race) percent(Race) recast(bar)
{res}
{com}. use titanic, clear
{err}{p 0 4 2}
file titanic.dta
not found
{p_end}
{txt}{search r(601):r(601);}

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. tabulate        Age, gen(g)

        {txt}Age {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      18-24 {c |}{res}         26       11.50       11.50
{txt}      25-30 {c |}{res}         61       26.99       38.50
{txt}      31-40 {c |}{res}         88       38.94       77.43
{txt}      41-50 {c |}{res}         25       11.06       88.50
{txt}      51-64 {c |}{res}         23       10.18       98.67
{txt} 65 or over {c |}{res}          3        1.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        226      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. tabulate        Age, gen(Age)

        {txt}Age {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      18-24 {c |}{res}         26       11.50       11.50
{txt}      25-30 {c |}{res}         61       26.99       38.50
{txt}      31-40 {c |}{res}         88       38.94       77.43
{txt}      41-50 {c |}{res}         25       11.06       88.50
{txt}      51-64 {c |}{res}         23       10.18       98.67
{txt} 65 or over {c |}{res}          3        1.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        226      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. #d ;
{txt}delimiter now ;
{com}. graph   bar 
>                 (mean) Age1 
>                 (mean) Age2
>                 (mean) Age3 
>                 (mean) Age4
>                 (mean) Age5 
>                 (mean) Age6             , 
>                 over(Race) 
>                 ytitle(Percentage) 
>                 title("Overall Age Distribution") 
>                 note("Note: This graph represents the age distribution of subjects by racial groups.") 
>                 scheme(s2mono)
>                 saving("${c -(}outdir{c )-}\Gender", replace)
>                 ;
{res}{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Gender.gph saved)

{com}. #d cr
{txt}delimiter now cr
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. #d ;
{txt}delimiter now ;
{com}. graph   bar 
>                 (mean) Age1 
>                 (mean) Age2
>                 (mean) Age3 
>                 (mean) Age4
>                 (mean) Age5 
>                 (mean) Age6             , 
>                 over(Race) 
>                 ytitle(Percentage) 
>                 title("Overall Age Distribution") 
>                 note("Note: This graph represents the age distribution of subjects by racial groups.") 
>                 legend(order(1 "18-24" 2 "25-30" 3 "31-40" 4 "41-50" 5 "51-60" 6 "65 or over")) 
>                 scheme(s2mono)
>                 saving("${c -(}outdir{c )-}\Age", replace)
>                 ;
{res}{txt}(note: file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Age.gph not found)
{res}{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Age.gph saved)

{com}. #d cr
{txt}delimiter now cr
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. tabulate        Education, gen(Education)

                {txt}Education {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
    Less than high school {c |}{res}          2        0.88        0.88
{txt}High School or equivalent {c |}{res}         32       14.16       15.04
{txt}             Some College {c |}{res}         69       30.53       45.58
{txt}         College Graduate {c |}{res}         85       37.61       83.19
{txt}          Master's Degree {c |}{res}         35       15.49       98.67
{txt}          Doctoral Degree {c |}{res}          3        1.33      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        226      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar 
>                 (mean) Education1 
>                 (mean) Education2
>                 (mean) Education3 
>                 (mean) Education4
>                 (mean) Education5 
>                 (mean) Education6, 
>                 over(Race) 
>                 ytitle(Percentage) 
>                 title("Overall Education Distribution") 
>                 note("Note: This graph represents the education distribution of subjects by racial groups.") 
>                 scheme(s2mono)
>                 saving("${c -(}outdir{c )-}\Education", replace)
>                 ;
{res}{txt}(note: file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Education.gph not found)
{res}{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Education.gph saved)

{com}. #d cr
{txt}delimiter now cr
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. #d ;
{txt}delimiter now ;
{com}. graph   bar 
>                 (mean) Education1 
>                 (mean) Education2
>                 (mean) Education3 
>                 (mean) Education4
>                 (mean) Education5 
>                 (mean) Education6, 
>                 over(Race) 
>                 ytitle(Percentage) 
>                 title("Overall Education Distribution") 
>                 note("Note: This graph represents the education distribution of subjects by racial groups.") 
>                 legend(order(1 "Less than high school" 2 "High school or equivalent" 3 "Some college" 4 "College Graduate" 5 "Master's Degree" 6 "Doctoral Degree")) 
>                 scheme(s2mono)
>                 saving("${c -(}outdir{c )-}\Education", replace)
>                 ;
{res}{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Education.gph saved)

{com}. #d cr
{txt}delimiter now cr
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. graph   combine Gender Age Education
{err}Gender is not a memory graph
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\asads\AppData\Local\Temp\STD01000000.tmp"
{txt}
{com}. graph   combine "${c -(}outdir{c )-}\Gender" "${c -(}outdir{c )-}\Age" "${c -(}outdir{c )-}\Education"
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Code\Analysis\DescriptiveStatistics.do"
{txt}
{com}. /* 
> This file generates an excel file which will be used to convert picture codes to graphic files
> Input: 
>         Demographic Survey Data
>         Experiment Data
> Output:
>         Approvals (file which is uploaded in MTurk to approve/reject submissions)
>         Bonus Payments (file which gives the code to use in CLI for bonus payments)
> 
> Written by: Sher Afghan Asad
> Date: 2018-09-24
>         
> */      
. 
. clear           all
{txt}
{com}. set                     more off
{txt}
{com}. capture         log close
{smcl}
{com}{sf}{ul off}