{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Analysis\Analysis_ 5 Oct 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Oct 2018, 18:59:09
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,529 observations deleted)

{com}. keep    if LastPage == "Qualified"
{txt}(152 observations deleted)

{com}. 
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)

{com}. *isid   WorkerID
. 
. save    "${c -(}tempdir{c )-}\DemographicData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Analysis\DemographicData.dta saved

{com}. 
. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 WorkerID = P
>                 LastPage = H
>                 PieceRate = AH
>                 Treatment = AG
>                 Points = AL
>                 GroupID = AF
>                 Role = O
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-10-03.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/16
{txt}(16 observations deleted)

{com}. drop    if LastPage != "SurveyCode" // These guys didn't complete the survey
{txt}(746 observations deleted)

{com}. drop    LastPage
{txt}
{com}. drop    if WorkerID == "AZ5ZYUCAQ0XDL" & Treatment == "Baseline"
{txt}(1 observation deleted)

{com}. 
. isid            WorkerID
{txt}
{com}. merge           1:m WorkerID using "${c -(}tempdir{c )-}\DemographicData", keep(3) keepusing(Gender Race Age Education) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             258{txt}  
{col 5}{hline 41}

{com}. 
. tab             Race

                                 {txt}Race {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
            Black or African-American {c |}{res}         32       12.40       12.40
{txt}                   White or Caucasian {c |}{res}        226       87.60      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}        258      100.00
{txt}
{com}. replace         Education = "College Graduate" if Education == "other_:Bachelors Degree"  
{txt}(1 real change made)

{com}. replace         Gender = "" if Gender == "Prefer not to answer" | Gender == "other_:transgender female"
{txt}(2 real changes made)

{com}. replace         Education = "Master's Degree" if Education == "Professional Degree"
{txt}(4 real changes made)

{com}. replace         Education = "High School or equivalent" if Education == "Vocational/Technical School"
{txt}(16 real changes made)

{com}. 
. label           define education 1 "Less than high school" 2 "High School or equivalent" 3 "Some College" 4 "College Graduate" 5 "Master's Degree" 6 "Doctoral Degree"
{txt}
{com}. encode          Education, gen(EducEnc) label(education) noextend
{txt}
{com}. drop            Education
{txt}
{com}. ren             EducEnc Education
{res}{txt}
{com}. 
. * Variation in piece rates
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count) if Role == 1, 
>                 over(PieceRate) over(Race)
>                 ytitle(Frequency) 
>                 title("Piece-Rate Distribution") 
>                 note("Note: This graph represents the distribution of piece rates (in dollars per 100 points) as selected" "by Black and White Employers. ", 
>                 margin(zero))
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}.                 
. graph   export "${c -(}outdir{c )-}\PieceRateDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\PieceRateDistribution 5 Oct 2018.png written in PNG format)

{com}.                 
. * Demographics of Subjects
. 
. * Gender
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count), 
>                 over(Gender) over(Race) 
>                 asyvars  
>                 title("Gender Distribution") 
>                 note("Note: This graph represents the gender distribution of subjects by racial groups.",margin(zero)) 
>                 
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\GenderDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\GenderDistribution 5 Oct 2018.png written in PNG format)

{com}. 
. * Age
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count), 
>                 over(Age) over(Race) 
>                 asyvars  
>                 title("Age Distribution") 
>                 note("Note: This graph represents the age distribution of subjects by racial groups.",margin(zero)) 
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\AgeDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\AgeDistribution 5 Oct 2018.png written in PNG format)

{com}. 
. * Education
. 
. #d ;
{txt}delimiter now ;
{com}. graph   bar (count), 
>                 over(Education) over(Race) 
>                 asyvars  
>                 title("Education Distribution") 
>                 note("Note: This graph represents the education distribution of subjects by racial groups.",margin(zero)) 
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\EducationDistribution$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\EducationDistribution 5 Oct 2018.png written in PNG format)

{com}. 
. * Effort against different piece rates
. 
. drop    if Points == 0 
{txt}(71 observations deleted)

{com}. tabstat Points if Role == 2 & Treatment == "Baseline", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        8  1169.099      1250
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}       17  686.4713  1750.824
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}       23  554.9694  2111.652
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        6  644.7573      1926
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       54  760.0681  1849.778
{txt}{hline 10}{c BT}{hline 30}

{com}. bysort GroupID (Race): gen EmployerRace = Race[1]
{txt}
{com}. 
. tabstat Points if Role == 2 & EmployerRace == "Black or African-American" & Treatment == "Race Salient", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        2  1386.636    1089.5
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}        2   185.262      2264
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}        4  709.8549      2919
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}        8  1064.665  2297.875
{txt}{hline 10}{c BT}{hline 30}

{com}. tabstat Points if Role == 2 & EmployerRace == "White or Caucasian" & Treatment == "Race Salient", statistics( count sd mean ) by(PieceRate) 

{txt}Summary for variables: Points
{col 6}by categories of: PieceRate 

{ralign 9:PieceRate} {...}
{c |}         N        sd      mean
{hline 10}{c +}{hline 30}
{ralign 9:0} {...}
{c |}{...}
 {res}        7  845.5235  1676.286
{txt}{ralign 9:.03} {...}
{c |}{...}
 {res}       12  959.3726    1824.5
{txt}{ralign 9:.06} {...}
{c |}{...}
 {res}       17  408.0927  2272.529
{txt}{ralign 9:.09} {...}
{c |}{...}
 {res}        3  585.8131      2654
{txt}{hline 10}{c +}{hline 30}
{ralign 9:Total} {...}
{c |}{...}
 {res}       39  748.4547      2057
{txt}{hline 10}{c BT}{hline 30}

{com}. 
. #d ;
{txt}delimiter now ;
{com}. twoway  (scatteri 1250 0.00 1751 0.03 2112 0.06 1926 0.09, 
>                 recast(connected)) 
>                 (scatteri 1089 0.00 2264 0.03 2919 0.06, recast(connected)) 
>                 (scatteri 1676 0.00 1825 0.03 2272 0.06 2654 0.09, recast(connected)), 
>                 ytitle(Average Effort (points)) 
>                 xtitle(Piece Rate (cents)) 
>                 title("Relation between piece rate and effort") 
>                 legend(order(1 "Baseline" 2 "Black Employer" 3 "White Employer"))
>                 ;
{res}{txt}
{com}. #d cr           
{txt}delimiter now cr
{com}. 
. graph   export "${c -(}outdir{c )-}\Results$S_DATE.png", replace
{txt}(file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Analysis\Results 5 Oct 2018.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. graph bar 0.8
{err}8 invalid name
{txt}{search r(198):r(198);}

{com}. graph bar (mean) GroupID if Gender == "Female"
{res}
{com}. graph bar (mean) GroupID if Gender == "Female" if Gender == "Female"
{err}invalid syntax
{txt}{search r(198):r(198);}

{com}. graph bar (count) if Gender == "Female", over(Gender)
{res}
{com}. do "C:\Users\asads\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. /* 
> This file generates an excel file which will be used to convert picture codes to graphic files
> Input: 
>         Demographic Survey Data
>         Experiment Data
> Output:
>         Approvals (file which is uploaded in MTurk to approve/reject submissions)
>         Bonus Payments (file which gives the code to use in CLI for bonus payments)
> 
> Written by: Sher Afghan Asad
> Date: 2018-09-24
>         
> */      
. 
. clear           all
{txt}
{com}. set                     more off
{txt}
{com}. capture         log close
{smcl}
{com}{sf}{ul off}