{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Documentation\Review Photographs\Review Photographs_ 2 Oct 2018.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Oct 2018, 17:30:30
{txt}
{com}. 
. * Import raw data from demographic survey
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 SurveyCode = B
>                 WorkerID = P
>                 Gender =Q
>                 Race = R
>                 Age = S
>                 Education = T
>                 Image = U
>                 LastPage = H
>                 using 
>                 "${c -(}rawdatadir{c )-}\demographic_survey_2018-10-01.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/6 // These obs are from testing session
{txt}(6 observations deleted)

{com}. drop    if LastPage == "Survey" | LastPage == "Consent" | LastPage == "" // These guys didn't complete the survey
{txt}(3,563 observations deleted)

{com}. keep    if LastPage == "Qualified"
{txt}(144 observations deleted)

{com}. 
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)

{com}. *isid   WorkerID
. 
. save    "${c -(}tempdir{c )-}\DemographicData", replace
{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Temp\Review Photographs\DemographicData.dta saved

{com}. 
. gen     FileName = substr(Race,1,1) + substr(Gender,1,1) + "_" + WorkerID
{txt}
{com}. 
. keep    WorkerID Image FileName
{txt}
{com}. gen     Saved = ""
{txt}(305 missing values generated)

{com}. gen     RaceMatched = ""
{txt}(305 missing values generated)

{com}. gen     GenderMatched = "" 
{txt}(305 missing values generated)

{com}. 
. export  excel using "${c -(}outdir{c )-}\RaceVerification_$S_DATE", replace firstrow(var)
{res}{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Review Photographs\RaceVerification_ 2 Oct 2018.xls saved

{com}. 
. * Import raw data from experiment
. 
. #d ;
{txt}delimiter now ;
{com}. import  excel 
>                 WorkerID = P
>                 LastPage = H
>                 PieceRateImage = AC
>                 PieceRate = AH
>                 using 
>                 "${c -(}rawdatadir{c )-}\experiment_2018-10-01.xlsx", 
>                 sheet("Sheet1") 
>                 cellrange(A2) clear
>                 ;
{res}{txt}
{com}. #d cr
{txt}delimiter now cr
{com}. 
. drop    in 1/16
{txt}(16 observations deleted)

{com}. drop    if LastPage != "SurveyCode" // These guys didn't complete the survey
{txt}(765 observations deleted)

{com}. drop    if PieceRateImage == "0"
{txt}(116 observations deleted)

{com}. 
. isid            WorkerID
{txt}
{com}. merge           1:m WorkerID using "${c -(}tempdir{c )-}\DemographicData", keep(3) keepusing(Gender Race) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             126{txt}  
{col 5}{hline 41}

{com}. drop            LastPage
{txt}
{com}. tostring        PieceRate, replace
{txt}PieceRate was {res:double} now {res:str3}

{com}. replace         PieceRate = subinstr(PieceRate, ".0","",.)
{txt}(123 real changes made)

{com}. 
. gen             FileName = substr(Race,1,1) + substr(Gender,1,1) + "_" + PieceRate + "_" + WorkerID
{txt}
{com}. 
. gen             Saved = ""
{txt}(126 missing values generated)

{com}. gen             AmountVisible = ""
{txt}(126 missing values generated)

{com}. gen             FaceVisible = ""
{txt}(126 missing values generated)

{com}. gen             HandVisible = ""
{txt}(126 missing values generated)

{com}. gen             OtherInfo = "" 
{txt}(126 missing values generated)

{com}. gen             RaceSalient = ""
{txt}(126 missing values generated)

{com}. export  excel using "${c -(}outdir{c )-}\PieceRatePicVerification_$S_DATE", replace firstrow(var)
{res}{txt}file C:\Users\asads\Dropbox\Discrimination\Intensive Margin\Output\Review Photographs\PieceRatePicVerification_ 2 Oct 2018.xls saved

{com}. 
{txt}end of do-file

{com}. exit, clear
